# encoding: utf-8

from OCC import VERSION # версія PythonOCC
print "OCC version",VERSION # версія '0.16.2-0.18.1'

# Геометричний процессор gp - незбережувані базові геометричні об'єкти
# З цими об'єктами працюють за значенням
from OCC.gp import *

# Збережувані базові 3D геометричні об'єкти
# Ці об'єкти STEP-оброблювані і з ними працюють за посиланням
from OCC.Geom import *
# Збережувані базові 2D геометричні об'єкти
# Ці об'єкти STEP-оброблювані і з ними працюють за посиланням
from OCC.Geom2d import *

# Алгоритми для побудови елементарних геометричних об'єктів OCC.Geom
from OCC.GC import *
# Алгоритми для побудови елементарних геометричних об'єктів OCC.Geom2d
from OCC.GCE2d import *